// 内置班级名单（离线/U盘版数据源，由 名单导入 JSON 生成，勿手改）
const ROSTER_DATA = [
  { id:'b1', name:'八1班', students:[
    '朱中凯', '邓萌萌', '李永钢', '国金月', '罗海瑜', '黄海涛', '周语彤', '谢浩东', '毛媛姝', '谢一立', '谢宗唯娜', '施睿婕', '姚思阳', '施娜', '刘定杰', '熊一想', '金玉素', '张纪元', '冉梦雪', '陈续恩', '王豪', '殷汨', '陈松', '饶自豪', '何雨成', '吉爽', '李泓澄', '黄浩', '萧倩', '陈秋杰', '况子月', '毛瑞荨', '黄韵涵', '张维宏', '赵泽瑞', '杨晨', '徐明菊', '张文诗婕', '邹佳影', '罗诗雨', '施雨萱', '陈灿', '冯昂', '杨娟', '谢婉秋', '尤家运', '李建浩', '朱梓涵', '尹丝柔', '刘欣玥', '陈慕然', '陈雅婷', '王舒俊', '赵景熙', '康妙', '张天宝', '翟益馨', '殷亦欣', '常国景', '王诗蕊', '殷媛', '顾琪', '罗溪妍', '徐涵晨颖', '萧远彤', '蒋玉琴'
  ]},
  { id:'b3', name:'八3班', students:[
    '艾春', '陈俊杰', '陈如江', '王雨航', '冯雨淳', '冯语涵', '符磊', '胡画岩', '黄诗语', '黄欣悦', '金宇豪', '李富升', '李航', '李思源', '李星月', '刘成', '刘定涛', '刘茂圆', '刘帅', '刘殷丽', '罗金龙', '罗孝忠', '罗义', '罗雨婷', '罗忠王', '彭爽', '饶宇雄', '石彤栩', '舒承姗', '陶金秀', '王佳云', '张南京', '张永发', '赵心蕊', '艾春玉', '付好', '黄仁杰', '杨庭雪', '陈明裕', '郭贤宇', '吴宇宸', '钟语涵', '陶静瑶', '王园', '明雨涵', '周诗语', '王运', '陈佳豪', '陈烨', '何家欢', '何夕月', '毛天宇', '张瑞龙', '郭雍', '邓丽欣', '管宇豪', '唐丽', '谢思雨', '张婷', '徐义晨', '张宇航', '何伟豪', '黄恩琦', '李子瑄', '陈冬阳', '王丹妮', '李恒', '罗应松', '周子涵', '丁浪', '李焕', '李玉平'
  ]},
  { id:'b6', name:'八6班', students:[
    '罗星睿', '方浩宇', '周航', '李阳锡', '吉豪祥', '孙睿', '彭埝', '蒋梦洁', '杨紫涵', '路羽', '蔡定成城', '尹婉婷', '罗恋', '庄恩泽', '王雪梅', '郑世迪', '王浩杰', '曾令东', '龙梦涵', '郭梦婷', '王智贤', '李家春', '余瑞黔', '陆玉盈', '饶宇博', '钟洪玉', '邓雨桐', '彭曼', '毛艺', '刘欣缘', '黄佑佳', '陈梓芯', '付孟恒', '付浩', '刘星', '杨昕妍', '文娅萁', '苏豪', '姚锦涵', '饶杰', '陈涛', '李源峰', '陈浩宇', '罗康', '陈楠', '杨倩', '王跃丽', '李相懋', '周思涵', '王绎楠', '陈媛媛', '李婷', '邓正艺', '文涵娟洁', '胡登欣羽', '郭满', '黄钦泰', '徐楷瑞', '刘赛雪', '黄怡晴', '朱龙群', '谭齐志'
  ]},
];
